lvx/base/Documents/бит_му_РасчетОтложенныхНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_РасчетОтложенныхНалогов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаОНА</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаОНО</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасходовДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто_4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСторно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетыОН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАктивовОбязательств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_ВидыАктивовОбязательств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНУ</Name>
							<Comment>Налоговая база</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМУ</Name>
							<Comment>Балансовая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПР</Name>
							<Comment>Постоянные разницы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВР</Name>
							<Comment>Временные разницы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОНА</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОНО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасходовДоходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтредактированоВручную</Name>
							<Comment>Данные строки отредактированы вручную</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНалогаНаПрибыль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/InformationRegisters/бит_му_РасчетыОтложенныхНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_РасчетыОтложенныхНалогов</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаМУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОНА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОНО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтредактированоВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_му_РасчетОтложенныхНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктивовОбязательств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_му_ВидыАктивовОбязательств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Documents/бит_му_РасчетОтложенныхНалогов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Справка - расчет отложенных налогов.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор	= "СправкаРасчетОН";
	КомандаПечати.Представление	= НСтр("ru='Справка - расчет отложенных налогов';en='Report-Calculation of Deferred Tax'");
	КомандаПечати.Обработчик	= "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок		= 10;	
	
	// Справка - расчет отложенных налогов с расшифровкой.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор					 = "ПолнаяСправкаРасчетОН";
	КомандаПечати.Представление 				 = НСтр("ru='Справка - расчет отложенных налогов с расшифровкой';
									   				    |en='Reference - interpreted calculation of deferred taxes'");
	КомандаПечати.Обработчик					 = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок						 = 20;	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаРасчетОН") Тогда					
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаРасчетОН",
			НСтр("ru='Справка-расчет в валюте регл. учета';en='Report-Calculation in Fiscal Accounting Currency'"), 
			СформироватьПечатнуюФормуСправкаРасчетОН(МассивОбъектов),,
			"Документ.бит_му_РасчетОтложенныхНалогов.СправкаРасчетОН");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПолнаяСправкаРасчетОН") Тогда					
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПолнаяСправкаРасчетОН",
			НСтр("ru='Справка-расчет в валюте взаиморасчетов';en='Report-Calculation in Mutual Settlement Currency'"), 
			СформироватьПечатнуюФормуПолнойСправкиРасчетОН(МассивОбъектов),,
			"Документ.бит_му_РасчетОтложенныхНалогов.ПолнаяСправкаРасчетОН");
	КонецЕсли;
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);		
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует печатную форму заявки на оплату.
// 
// Параметры:
//  МассивСсылок - Массив.
// 
// Возвращаемое значение:
//  ТабличныйДокумент.
// 
Функция СформироватьПечатнуюФормуСправкаРасчетОН(МассивСсылок)

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_РасчетОтложенныхНалогов_СправкаРасчетОН";  	
	
	// Таблица по документам.
	ТаблицаДокументов = ДокументыРасчетаОтложенныхНалогов(МассивСсылок);
	
	Если ТаблицаДокументов.Количество() > 0 Тогда
			
		// Получаем макет и области.
		Макет = Документы.бит_му_РасчетОтложенныхНалогов.ПолучитьМакет("СправкаРасчетОН");
		ОбластьЗаголовок 	  = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка 		  = Макет.ПолучитьОбласть("Шапка");
		ОбластьРасчетыОНШапка = Макет.ПолучитьОбласть("РасчетыОНШапка");
		ОбластьРасчетыОН 	  = Макет.ПолучитьОбласть("РасчетыОН");
		ОбластьПодвал 		  = Макет.ПолучитьОбласть("Подвал");
	    ОбластьИтоги          = Макет.ПолучитьОбласть("Итоги");
		
		
		// Таблица по табличной части.
		ТаблицаРасчетовОН = ДанныеПоРасчетамОН(МассивСсылок);
		
		// Вывод результатов.
		ПервыйДокумент   = Истина;
				
		Для каждого СтрДокумент Из ТаблицаДокументов Цикл
					
			// Текущий документ.
			ТекДокумент = СтрДокумент.Ссылка;
			// Отбор для таблиц по текущему документу.
			Отбор = Новый Структура;
			Отбор.Вставить("Ссылка", ТекДокумент);
											
			// Разделитель страниц.
			Если Не ПервыйДокумент Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;

			// Заполним общие для документа параметры.
			ОбластьЗаголовок.Параметры.Заполнить(СтрДокумент);
			ОбластьЗаголовок.Параметры.Дата = Формат(СтрДокумент.Дата, "ДЛФ=D");
			ОбластьШапка.Параметры.Заполнить(СтрДокумент);
			ОбластьПодвал.Параметры.Заполнить(СтрДокумент);
			
			// Выведем Заголовок и шапку.
			ТабДок.Вывести(ОбластьЗаголовок);
		    ТабДок.Вывести(ОбластьШапка);
		    ТабДок.Вывести(ОбластьРасчетыОНШапка);  	
			
			// Заполняем данные по табличной части и итогам для печатной формы.
			МассивСтрок = ТаблицаРасчетовОН.НайтиСтроки(Отбор);
			Для Каждого ТекСтрока Из МассивСтрок Цикл
				
				Если ТекСтрока.ЭтоИтоги Тогда
				    ОбластьИтоги.Параметры.Заполнить(ТекСтрока);
				Иначе
					ОбластьРасчетыОН.Параметры.Заполнить(ТекСтрока);
					// Выводим строки таблицы.
					ТабДок.Вывести(ОбластьРасчетыОН);
				КонецЕсли;
						
			КонецЦикла; 

			// Выводим итоги и подвал.
			ТабДок.Вывести(ОбластьИтоги);
			ТабДок.Вывести(ОбластьПодвал);
			
		КонецЦикла;
	
	КонецЕсли;

	ТабДок.АвтоМасштаб = Истина;
	
    Возврат ТабДок;
	
КонецФункции

// Функция формирует печатную форму заявки на оплату.
// 
// Параметры:
//  МассивСсылок - Массив.
// 
// Возвращаемое значение:
//  ТабличныйДокумент.
// 
Функция СформироватьПечатнуюФормуПолнойСправкиРасчетОН(МассивСсылок)

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_РасчетОтложенныхНалогов_ПолнаяСправкаРасчетОН";  	
	
	// Таблица по документам.
	ТаблицаДокументов = ДокументыРасчетаОтложенныхНалогов(МассивСсылок);
	
	Если ТаблицаДокументов.Количество() > 0 Тогда
			
		// Получаем макет и области.
		Макет = Документы.бит_му_РасчетОтложенныхНалогов.ПолучитьМакет("ПолнаяСправкаРасчетОН");
		ОбластьЗаголовок 	  = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка 		  = Макет.ПолучитьОбласть("Шапка");
		ОбластьРасчетыОНШапка = Макет.ПолучитьОбласть("РасчетыОНШапка");
		ОбластьРасчетыОН 	  = Макет.ПолучитьОбласть("РасчетыОН");
		ОбластьИсточник       = Макет.ПолучитьОбласть("Источник");
		ОбластьРасшифровка    = Макет.ПолучитьОбласть("Расшифровка");
		ОбластьПодвал 		  = Макет.ПолучитьОбласть("Подвал");
	    ОбластьИтоги          = Макет.ПолучитьОбласть("Итоги");
				
		// Результат основного запроса.
		Результат = ПолучитьРезультатПолный(МассивСсылок);
		
		// Вывод результатов.
		ПервыйДокумент   = Истина;
		ВыборкаДокументы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Пока ВыборкаДокументы.Следующий() Цикл
			
			// Текущий документ.
			ТекДокумент = ВыборкаДокументы.Ссылка;
			// Отбор для таблиц по текущему документу.
			Отбор = Новый Структура;
			Отбор.Вставить("Ссылка", ТекДокумент);
									
			// Разделитель страниц.
			Если Не ПервыйДокумент Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;


			// Заполним общие для документа параметры.
			МассивСтрок = ТаблицаДокументов.НайтиСтроки(Отбор);
			Для каждого Стр Из МассивСтрок Цикл
				ОбластьЗаголовок.Параметры.Заполнить(Стр);
				ОбластьЗаголовок.Параметры.Дата = Формат(Стр.Дата, "ДЛФ=D");
				ОбластьШапка.Параметры.Заполнить(Стр);
				ОбластьПодвал.Параметры.Заполнить(Стр);
			КонецЦикла;
			ОбластьИтоги.Параметры.Заполнить(ВыборкаДокументы);
			
			// Выведем Заголовок и шапку.
			ТабДок.Вывести(ОбластьЗаголовок);
		    ТабДок.Вывести(ОбластьШапка);
		    ТабДок.Вывести(ОбластьРасчетыОНШапка);  	
			
			ТабДок.НачатьАвтогруппировкуСтрок();
			
			// Заполняем данные по табличной части и итогам для печатной формы.
			ВыборкаВиды = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаВиды.Следующий() Цикл
				
				ОбластьРасчетыОН.Параметры.Заполнить(ВыборкаВиды);
				ТабДок.Вывести(ОбластьРасчетыОН, 0);
					
				ВыборкаИсточники = ВыборкаВиды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				Пока ВыборкаИсточники.Следующий() Цикл
					
					ОбластьИсточник.Параметры.Заполнить(ВыборкаИсточники);
					ТабДок.Вывести(ОбластьИсточник, 1);
						
					ВыборкаРасш = ВыборкаИсточники.Выбрать();
					Пока ВыборкаРасш.Следующий() Цикл

						ОбластьРасшифровка.Параметры.Заполнить(ВыборкаРасш);
						ТабДок.Вывести(ОбластьРасшифровка, 2);
												
					КонецЦикла;

				КонецЦикла;
			
			КонецЦикла; 
			
			ТабДок.ЗакончитьАвтогруппировкуСтрок();
			ТабДок.ОтображатьГруппировки = Истина;
			ТабДок.ФиксацияСлева = 10;
			    						
			// ТабДок.ПоказатьУровеньГруппировокСтрок(1);
			
			// Выводим итоги и подвал.
			ТабДок.Вывести(ОбластьИтоги);
			ТабДок.Вывести(ОбластьПодвал);
			
		КонецЦикла;
					
	КонецЕсли; 
	
	ТабДок.АвтоМасштаб = Истина;  	
	
    Возврат ТабДок;
	
КонецФункции

// Функция получает результат основного запроса.
// 
// Параметры:
//  МассивСсылок - Массив.
//  
// Возвращаемое значение:
//   Результат запроса.
// 
Функция ДокументыРасчетаОтложенныхНалогов(МассивСсылок)

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
    |	ДокументыРасчетОН.Ссылка,
    |	ДокументыРасчетОН.ВалютаДокумента,
    |	ДокументыРасчетОН.Дата,
    |	ДокументыРасчетОН.Организация,
    |	ДокументыРасчетОН.Ответственный,
    |	ДокументыРасчетОН.СтавкаНалогаНаПрибыль,
    |	ДокументыРасчетОН.Номер
    |ИЗ
    |	Документ.бит_му_РасчетОтложенныхНалогов КАК ДокументыРасчетОН
    |ГДЕ
    |	ДокументыРасчетОН.Ссылка В(&МассивСсылок)
	|";
	Запрос.Параметры.Вставить("МассивСсылок", МассивСсылок);
	Результат = Запрос.Выполнить();
	
	ТаблицаДокументов = Результат.Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции

// Функция получает данные по табличным частям документов.
// 
// Параметры:
//  МассивСсылок - Массив ссылок на документ бит_РасчетОтложенныхНалогов.
//  
// Возвращаемое значение:
//   Таблица значений.
// 
Функция ДанныеПоРасчетамОН(МассивСсылок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РасчетыОН.Ссылка,
	|	ЛОЖЬ КАК ЭтоИтоги,
	|	РасчетыОН.ВидАктивовОбязательств,
	|	РасчетыОН.СуммаНУ 				КАК СуммаНУ,
	|	РасчетыОН.СуммаМУ 				КАК СуммаМУ,
	|	РасчетыОН.СуммаПР 				КАК СуммаПР,
	|	РасчетыОН.СуммаВР	 			КАК СуммаВР,
	|	РасчетыОН.СтавкаНалогаНаПрибыль КАК СтавкаНалогаНаПрибыль,
	|	РасчетыОН.СуммаОНА 				КАК СуммаОНА,
	|	РасчетыОН.СуммаОНО 				КАК СуммаОНО
	|ИЗ
	|	Документ.бит_му_РасчетОтложенныхНалогов.РасчетыОН КАК РасчетыОН
	|ГДЕ
	|	РасчетыОН.Ссылка  В(&МассивСсылок)
	|ИТОГИ
	|	МАКСИМУМ(Ссылка),
	|	ИСТИНА КАК ЭтоИтоги,
	|	СУММА(СуммаНУ),
	|	СУММА(СуммаМУ),
	|	СУММА(СуммаПР),
	|	СУММА(СуммаОНА),
	|	СУММА(СуммаОНО)
	|ПО
	|	ОБЩИЕ
	|";
	Запрос.Параметры.Вставить("МассивСсылок", МассивСсылок);
	Результат = Запрос.Выполнить();
	
	ТаблицаПоРасчетамОН = Результат.Выгрузить();
	
	Возврат ТаблицаПоРасчетамОН;
	
КонецФункции

// Функция получает данные по табличным частям документов
// и по регистру сведений бит_му_РасчетОтложенныхНалогов. 
// 
// Параметры:
//  МассивСсылок - Массив ссылок на документ бит_РасчетОтложенныхНалогов.
//  
// Возвращаемое значение:
//   Таблица значений.
// 
Функция ПолучитьРезультатПолный(МассивСсылок)
	                          	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыОН.Ссылка КАК Ссылка,
	|	РасчетыОН.ВидАктивовОбязательств КАК ВидАктивовОбязательств,
	|	ВЫБОР
	|		КОГДА РасшифровкаРасчетов.ИсточникДанных = ЗНАЧЕНИЕ(Справочник.бит_ИсточникиДанных.ПустаяСсылка)
	|			ТОГДА &ТекстИсточникДанных
	|		ИНАЧЕ РасшифровкаРасчетов.ИсточникДанных
	|	КОНЕЦ КАК ИсточникДанных,
	|	РасшифровкаРасчетов.СуммаНУ КАК СуммаНУ,
	|	РасшифровкаРасчетов.СуммаМУ КАК СуммаМУ,
	|	РасшифровкаРасчетов.СуммаПР КАК СуммаПР,
	|	РасшифровкаРасчетов.СуммаВР КАК СуммаВР,
	|	РасшифровкаРасчетов.СтавкаНалогаНаПрибыль КАК СтавкаНалогаНаПрибыль,
	|	РасшифровкаРасчетов.СуммаОНА КАК СуммаОНА,
	|	РасшифровкаРасчетов.СуммаОНО КАК СуммаОНО,
	|	РасшифровкаРасчетов.Организация КАК Организация,
	|	РасшифровкаРасчетов.Субконто1 КАК Субконто1,
	|	РасшифровкаРасчетов.Субконто2 КАК Субконто2,
	|	РасшифровкаРасчетов.Субконто3 КАК Субконто3,
	|	1 КАК Количество
	|ИЗ
	|	Документ.бит_му_РасчетОтложенныхНалогов.РасчетыОН КАК РасчетыОН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_РасчетыОтложенныхНалогов КАК РасшифровкаРасчетов
	|		ПО РасчетыОН.Ссылка = РасшифровкаРасчетов.Документ
	|			И РасчетыОН.ВидАктивовОбязательств = РасшифровкаРасчетов.ВидАктивовОбязательств
	|ГДЕ
	|	РасчетыОН.Ссылка В(&МассивСсылок)
	|ИТОГИ
	|	СУММА(СуммаНУ),
	|	СУММА(СуммаМУ),
	|	СУММА(СуммаПР),
	|	СУММА(СуммаВР),
	|	СУММА(СтавкаНалогаНаПрибыль) / СУММА(Количество) КАК СтавкаНалогаНаПрибыль,
	|	СУММА(СуммаОНА),
	|	СУММА(СуммаОНО)
	|ПО
	|	Ссылка,
	|	ВидАктивовОбязательств,
	|	ИсточникДанных";
	
	Запрос.Параметры.Вставить("МассивСсылок", МассивСсылок);
	Запрос.Параметры.Вставить("ТекстИсточникДанных", НСтр("ru = 'Отредактировано вручную'"));
	Результат = Запрос.Выполнить();
			
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
